/*
打印2006年12月日历

Calendar 2006-12

----------------------------
Su  Mo  Tu  We  Th  Fr  Sa 
----------------------------
					 1	 2
 3 	 4	 5	 6	 7	 8	 9
10	11	12	13	14	15	16
17	18	19	20	21	22	23
24	25	26	27	28	29	30
31
----------------------------
*/
#include<stdio.h>
int main()
{
	int i;
	printf("Calendar 2006-12 \n");
	printf("\n----------------------------\n");
	printf("  Su  Mo  Tu  We  Th  Fr  Sa ");
	printf("\n----------------------------\n");
	for( i=0;i<5;i++ )
		printf("    ");
	for( i=1;i<=31;i++ )
	{
		printf("%4d",i);
		if( i%7==2 )
			printf("\n");
	}
	printf("\n----------------------------\n");
	return 0;
}